---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.DuctLegend
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.DuctLegend

Places a legend to indicate the color fills associated with ductwork in duct systems.